In [1]:
## pandas是基于NumPy构建的，让以NumPy为中心的应用变得更加简单
##  约定： 
##  from pandas import Series, DataFrame
##  import pandas as pd

In [2]:
# pandas的数据结构介绍

In [3]:
## 要使用pandas，你首先要熟悉它的两个主要数据结构： Series和DataFrame

In [4]:
## Series

In [5]:
#Series由一组数据以及与之相关的数据标签组成

In [6]:
from pandas import Series, DataFrame
import pandas as pd

In [7]:
obj = Series([4,7,-5,3])

In [8]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [9]:
## 可以通过Series的values和index属性获取其数组表示形式和索引对象

In [10]:
obj.values

array([ 4,  7, -5,  3])

In [11]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [12]:
obj2 = Series([4,7,-5,3], index=['d','b','a','c'])

In [13]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [14]:
obj2.index

Index([u'd', u'b', u'a', u'c'], dtype='object')

In [15]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [16]:
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

In [17]:
obj2*2

d     8
b    14
a   -10
c     6
dtype: int64

In [19]:
import numpy as np
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [20]:
'b' in obj2

True

In [21]:
sdata = {'Ohio':35000, 'Texas': 71000, 'Oregon':16000, 'Utah': 5000}
obj3 = Series(sdata)

In [22]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [23]:
states = ['California','Ohio','Oregon','Texas']
obj4 = Series(sdata, index = states)

In [24]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [25]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [26]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [27]:
## Series 也有类似的实例方法

In [28]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [29]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [30]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [31]:
## 这里有一点不懂，为什么Utah会为NaN
## Series最重要的一个功能是：他在算术运算中会自动对齐不同索引的数据
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [32]:
obj4.name = 'population'

In [33]:
obj4.index.name = 'state'

In [34]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [35]:
## Series的索引可以通过赋值的方式就地修改
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [36]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [37]:
# DataFrame

In [38]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2001,2002], 'pop': [1.5,1.7,3.6,2.4,3.9]}

In [39]:
frame = DataFrame(data)

In [40]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  3.9  Nevada  2002

In [41]:
DataFrame(data, columns = ['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  3.9

In [42]:
## 和Series一样如果传入的列在数据中找不到，就会产生NA值

In [43]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index = ['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  3.9  NaN

In [44]:
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [45]:
## 通过类似字典标记的方式或属性的方式，可以将DataFrame的列获取维一个Series
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [46]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [47]:
frame2['debt'] = np.arange(5)

In [48]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  3.9     4

In [49]:
## 将列表和数组付给某个列是，其长度必须跟DataFrame的长度相匹配 如果赋值的是一个Series，就会精确匹配DataFrame的索引，所有的空位都将被填上确实值

In [50]:
val = Series([-1.2, -1.5, -1.7], index = ['two', 'four', 'five'])
frame2['debt'] = val

In [51]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  3.9  -1.7

In [52]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  3.9  -1.7   False

In [53]:
del frame2['eastern']

In [54]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  3.9  -1.7

In [55]:
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [56]:
# 索引对象

In [57]:
obj = Series(range(3), index = ['a', 'b', 'c'])

In [58]:
index = obj.index

In [59]:
index

Index([u'a', u'b', u'c'], dtype='object')

In [60]:
index[1:]

Index([u'b', u'c'], dtype='object')

In [61]:
## Index对象的不可修改的 immtable
index[1] = 'd'

TypeError: Index does not support mutable operations

In [62]:
## Index对象昂的不可修改性很重要，这样Index对象在多个数据结构之间安全共享

In [63]:
index = pd.Index(np.arange(3))

In [64]:
index

Int64Index([0, 1, 2], dtype='int64')

In [65]:
obj2 = Series([1.5, 0, -1.5], index = index)

In [66]:
obj2.index is index

True

In [67]:
# 基本功能

In [68]:
## 重新索引

In [69]:
obj = Series([4.5, 7.2, -5.3, 3.6], index = ['d', 'b', 'a', 'c'])

In [70]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [71]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [72]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [73]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value = 0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [74]:
### 插值处理

In [76]:
obj3 = Series(['blue', 'purple', 'yellow'], index = [0, 2, 4])
obj3.reindex(range(6), method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [77]:
### method选项中  ffill是前向值填充

In [78]:
frame = DataFrame(np.arange(9).reshape((3,3)), index = ['a', 'b', 'd'], columns = ['Ohio', 'Texas', 'California'])

In [79]:
frame

   Ohio  Texas  California
a     0      1           2
b     3      4           5
d     6      7           8

In [82]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   3.0    4.0         5.0
c   NaN    NaN         NaN
d   6.0    7.0         8.0

In [84]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns = states)

   Texas  Utah  California
a      1   NaN           2
b      4   NaN           5
d      7   NaN           8

In [1]:
# 丢弃指定轴上的项

In [4]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [6]:
obj = Series(np.arange(5.), index = ['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [8]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [9]:
obj.drop(['b', 'c'])

a    0.0
d    3.0
e    4.0
dtype: float64

In [10]:
## 对于DataFrame可以删除任意轴上的索引值

In [11]:
data = DataFrame(np.arange(16).reshape((4,4)), index = ['Ohio', 'Colorado', 'Utah', 'New York'], columns = ['one', 'two', 'three', 'four'])

In [12]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [13]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [14]:
data.drop('one')

ValueError: labels ['one'] not contained in axis

In [15]:
data.drop('one', axis = 1)

          two  three  four
Ohio        1      2     3
Colorado    5      6     7
Utah        9     10    11
New York   13     14    15

In [16]:
# 索引、选取和过滤

In [17]:
obj = Series(np.arange(4), index=['a', 'b', 'c', 'd'])
obj['b']

1

In [18]:
obj[1]

1

In [19]:
obj[[1,3]]

b    1
d    3
dtype: int64

In [20]:
obj[1:3]

b    1
c    2
dtype: int64

In [21]:
obj[obj <2]

a    0
b    1
dtype: int64

In [22]:
#### Atention: 这个区间需要注意  python都是前闭后开

In [24]:
data = DataFrame(np.arange(16).reshape((4,4)),index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])

In [25]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [27]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [28]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [29]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [30]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [31]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [35]:
## 为了方便进行标签索引 专门引入索引字段ix

In [36]:
 data.ix['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [37]:
data.ix[['Colorado', 'Utah'], [3,0,1]]

          four  one  two
Colorado     7    4    5
Utah        11    8    9

In [38]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [39]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [40]:
data.ix[:'Utah', 'two']

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int64

In [41]:
data.ix[data.three>5, :3]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [42]:
## DataFrame对数据的索引方式有很多种   需要我们根据自己的需求合理取选择方法

In [43]:
# 算术运算和数据对齐

In [44]:
s1 = Series([7,3,4,5], index = ['a', 'b', 'c', 'd'])
s2 = Series([2,4,6,7,4], index = ['a', 'b', 'c', 'd', 'g'])

In [45]:
s1

a    7
b    3
c    4
d    5
dtype: int64

In [46]:
s2

a    2
b    4
c    6
d    7
g    4
dtype: int64

In [47]:
s1+s2

a     9.0
b     7.0
c    10.0
d    12.0
g     NaN
dtype: float64

In [48]:
## 对于DataFrame也一样

In [49]:
# 算术运算中的填充值

In [50]:
df1 = DataFrame(np.arange(12).reshape((3,4)), columns = list('abcd'))
df2 = DataFrame(np.arange(20).reshape((4,5)), columns = list('abcde'))

In [51]:
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [52]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [53]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [54]:
df1.add(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [55]:
df1.reindex(columns = df2.columns, fill_value = 0)

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

In [56]:
# DataFrame和Series之间的运算

In [57]:
# 函数应用和映射

In [58]:
frame = DataFrame(np.random.randn(4,3), columns = list('bde'), index = ['Utah', 'Ohio', 'Texas', 'Oregeon'])
frame

                b         d         e
Utah     0.289079  0.284262  0.653208
Ohio     0.237475  1.321214 -0.742483
Texas    0.053799 -0.323129 -0.096276
Oregeon -0.062501  0.007861  1.221925

In [59]:
np.abs(frame)

                b         d         e
Utah     0.289079  0.284262  0.653208
Ohio     0.237475  1.321214  0.742483
Texas    0.053799  0.323129  0.096276
Oregeon  0.062501  0.007861  1.221925

In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [2]:
frame = DataFrame(np.random.randn(4,3), columns = list('bde'), index = ['Utah', 'Ohio', 'Texas', 'Oregeon'])
frame

                b         d         e
Utah    -0.457392  0.647293  0.359507
Ohio     0.722236  0.772245 -0.647083
Texas    0.324724 -0.147833 -1.070943
Oregeon -1.849108 -0.988832  0.574453

In [3]:
f = lambda x:x.max()-x.min()

In [4]:
frame.apply(f)

b    2.571344
d    1.761077
e    1.645396
dtype: float64

In [5]:
frame.apply(f, axis = 1)

Utah       1.104685
Ohio       1.419328
Texas      1.395667
Oregeon    2.423562
dtype: float64

In [6]:
def f(x):
    return Series([x.min(), x.max()], index = ['min', 'max'])

In [7]:
frame.apply(f)

            b         d         e
min -1.849108 -0.988832 -1.070943
max  0.722236  0.772245  0.574453

In [8]:
format = lambda x: '%.2f' % x

In [9]:
frame.applymap(format)

             b      d      e
Utah     -0.46   0.65   0.36
Ohio      0.72   0.77  -0.65
Texas     0.32  -0.15  -1.07
Oregeon  -1.85  -0.99   0.57

In [10]:
frame['e'].map(format)

Utah        0.36
Ohio       -0.65
Texas      -1.07
Oregeon     0.57
Name: e, dtype: object

In [19]:
# 排序和排名

In [20]:
## 感觉和NumPy差不太多

In [21]:
## 按照索引不同进行的排序

obj = Series(range(4), index = list('dabc'))
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [22]:
frame = DataFrame(np.arange(8).reshape((2,4)), index = ['three', 'one'], columns = list('dabc'))
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [23]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [24]:
frame.sort_index(axis = 1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [25]:
frame.sort_index(axis = 1, ascending= False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [26]:
##  按照值排序

In [28]:
obj = Series([4,7,-3,2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [29]:
frame = DataFrame({'b':[4,7,-3,2], 'a':[0,1,0,1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [30]:
frame.sort_index(by = 'b')

/home/liangzelang/anaconda2/lib/python2.7/site-packages/ipykernel/__main__.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  if __name__ == '__main__':

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [31]:
frame.sort_values(by = 'b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [32]:
frame.sort_values(by = ['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [33]:
obj = Series([7, -5,7,4,2,0,4])  ## 没有懂呀
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [34]:
obj.rank(method = 'first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [35]:
obj.rank(ascending = False, method = 'max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [12]:
# 带有重复值的轴索引

In [36]:
obj = Series(range(5), index = ['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [37]:
obj.index.is_unique

False

In [38]:
obj['a']

a    0
a    1
dtype: int64

In [39]:
df = DataFrame(np.random.randn(4,3), index = ['a', 'a', 'b', 'b'])
df

          0         1         2
a -0.842100  0.098507  1.421606
a  0.785221  1.929340 -0.693485
b  1.155135 -0.882019 -1.799160
b -1.220875 -0.534385 -1.437487

In [42]:
df.ix['b']

          0         1         2
b  1.155135 -0.882019 -1.799160
b -1.220875 -0.534385 -1.437487

In [13]:
# 汇总和计算描述统计

In [43]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], index = ['a', 'b', 'c', 'd'], columns = ['one', 'two'])

In [44]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [45]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [46]:
df.sum(axis = 1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [48]:
df.mean(axis = 1, skipna = False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [49]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [50]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [51]:
df.idxmax()

one    b
two    d
dtype: object

In [52]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [53]:
obj = Series(['a', 'a', 'b', 'c']*4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [54]:
# 相关系数与协方差

In [61]:
###   这块不知道怎么弄错了

In [15]:
# 唯一值、值计数以及成员资格

In [62]:
obj = Series(['a', 'c', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [63]:
uniques = obj.unique()

In [64]:
uniques

array(['a', 'c', 'd', 'b'], dtype=object)

In [66]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [67]:
pd.value_counts(obj.values, sort = False)

a    3
c    3
b    2
d    1
dtype: int64

In [68]:
mask = obj.isin(['b', 'c'])
mask

0    False
1     True
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [69]:
obj[mask]

1    c
5    b
6    b
7    c
8    c
dtype: object

In [70]:
data = DataFrame({'Qu1': [1,3,4,3,4], 'Qu2':[2,3,1,2,4], 'Qu3':[1,5,2,4,4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    4    4

In [71]:
result = data.apply(pd.value_counts).fillna(0)

In [72]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  1.0  0.0
4  2.0  1.0  2.0
5  0.0  0.0  1.0

In [16]:
# 处理缺失数据

In [73]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [74]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [75]:
string_data[0] = None

In [76]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [77]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [79]:
string_data.fillna('ILoveU')

0       ILoveU
1    artichoke
2       ILoveU
3      avocado
dtype: object

In [17]:
# 滤除缺失数据

In [80]:
from numpy import nan as NA

In [81]:
data = Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [82]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [83]:
data = DataFrame([[1, 6.5, 3], [1, NA, NA], [NA, NA, NA], [NA, 6.5, 3]])
cleaned = data.dropna()

In [84]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [85]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [18]:
# 填充缺失数据

In [86]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [87]:
df.fillna(0)

    one  two
a  1.40  0.0
b  7.10 -4.5
c  0.00  0.0
d  0.75 -1.3

In [88]:
df = DataFrame(np.random.randn(6,3))
df.ix[2:, 1] = NA; 
df.ix[4:, 2] = NA;
df

          0         1         2
0  0.584171 -0.015039  1.207467
1 -0.614816 -0.059511 -0.293999
2 -0.764893       NaN -1.054369
3  0.421566       NaN  1.495056
4  0.533430       NaN       NaN
5 -1.082961       NaN       NaN

In [89]:
df.fillna(method = 'ffill')

          0         1         2
0  0.584171 -0.015039  1.207467
1 -0.614816 -0.059511 -0.293999
2 -0.764893 -0.059511 -1.054369
3  0.421566 -0.059511  1.495056
4  0.533430 -0.059511  1.495056
5 -1.082961 -0.059511  1.495056

In [90]:
df.fillna(method = 'ffill', limit = 2)

          0         1         2
0  0.584171 -0.015039  1.207467
1 -0.614816 -0.059511 -0.293999
2 -0.764893 -0.059511 -1.054369
3  0.421566 -0.059511  1.495056
4  0.533430       NaN  1.495056
5 -1.082961       NaN  1.495056

In [91]:
data = Series([1, NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [92]:
# 层次化索引

In [94]:
data = Series(np.random.randn(10), index = [['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'], [1,2,3,1,2,3,1,2,2,3]])
data

a  1    0.224851
   2   -0.190379
   3    0.410043
b  1   -0.095459
   2   -0.291027
   3   -0.007214
c  1    0.257781
   2    0.843709
d  2   -0.349222
   3   -0.834526
dtype: float64

In [95]:
data.index

MultiIndex(levels=[[u'a', u'b', u'c', u'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [96]:
data['b']

1   -0.095459
2   -0.291027
3   -0.007214
dtype: float64

In [97]:
data[:, 2]

a   -0.190379
b   -0.291027
c    0.843709
d   -0.349222
dtype: float64

In [98]:
data.unstack()

          1         2         3
a  0.224851 -0.190379  0.410043
b -0.095459 -0.291027 -0.007214
c  0.257781  0.843709       NaN
d       NaN -0.349222 -0.834526

In [99]:
data.unstack().stack()

a  1    0.224851
   2   -0.190379
   3    0.410043
b  1   -0.095459
   2   -0.291027
   3   -0.007214
c  1    0.257781
   2    0.843709
d  2   -0.349222
   3   -0.834526
dtype: float64

In [100]:
frame = DataFrame(np.arange(12).reshape((4,3)), index = [['a', 'a', 'b', 'b'], [1,2,1,2]], columns = [['Ohio', 'Ohio', 'Colorado'], ['Green', 'RED', 'GREEN']])

In [101]:
frame

     Ohio     Colorado
    Green RED    GREEN
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [102]:
frame.index.names

FrozenList([None, None])

In [103]:
frame

     Ohio     Colorado
    Green RED    GREEN
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [104]:
# 重排分级顺序

In [105]:
frame.swaplevel(1)

     Ohio     Colorado
    Green RED    GREEN
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [106]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']

In [107]:
frame

state      Ohio     Colorado
color     Green RED    GREEN
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [108]:
frame.swaplevel(1)

state      Ohio     Colorado
color     Green RED    GREEN
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [109]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green RED    GREEN
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [110]:
frame.sortlevel(1)

state      Ohio     Colorado
color     Green RED    GREEN
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [111]:
frame.swaplevel(0,1).sortlevel(0)

state      Ohio     Colorado
color     Green RED    GREEN
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [112]:
frame.swaplevel(0,1)

state      Ohio     Colorado
color     Green RED    GREEN
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [113]:
frame

state      Ohio     Colorado
color     Green RED    GREEN
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [1]:
# 使用DataFrame的列
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [2]:
frame = DataFrame({'a':range(7), 'b':range(7,0,-1), 'c':['one', 'one', 'one', 'two', 'two', 'two', 'two'], 'd':[0,1,2,0,1,2,3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [3]:
frame2 = frame.set_index(['c', 'd'])

In [4]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [5]:
frame.set_index(['c', 'd'], drop = False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [6]:
# 有关pandas的其他话题
# 整数索引

In [7]:
ser = Series(np.arange(3))

In [9]:
ser[0]

0

In [10]:
ser

0    0
1    1
2    2
dtype: int64

In [11]:
ser2 = Series(np.arange(3), index= list('abc'))

In [12]:
ser2[-1]

2

In [13]:
ser2

a    0
b    1
c    2
dtype: int64

In [14]:
ser3 = Series(range(3), index = [-5,1,3])
ser3.iget_value(2)

/home/liangzelang/anaconda2/lib/python2.7/site-packages/ipykernel/__main__.py:2: FutureWarning: iget_value(i) is deprecated. Please use .iloc[i] or .iat[i]
  from ipykernel import kernelapp as app

2

In [15]:
frame = DataFrame(np.arange(6).reshape(3,2), index = [2,0,1])
frame.irow(0)

/home/liangzelang/anaconda2/lib/python2.7/site-packages/ipykernel/__main__.py:2: FutureWarning: irow(i) is deprecated. Please use .iloc[i]
  from ipykernel import kernelapp as app

0    0
1    1
Name: 2, dtype: int64

In [16]:
frame

   0  1
2  0  1
0  2  3
1  4  5

In [17]:
# 面板数据

In [19]:
pdata = pd.Panel(dict((stk, pandas.io.data.get_data_yahoo(stk, '1/1/2009', '6/1/2012')), for stk in ['AAPL', 'GOOG', 'MSFT', 'DELL']))

SyntaxError: invalid syntax (<ipython-input-19-c037a3586c99>, line 1)

In [ ]:
###  这个不知道为什么错了